---
kind: method
id: M:Autodesk.Revit.DB.View.CanUseTemporaryVisibilityModes
zh: 视图
source: html/a1991bf3-0e70-06c4-5304-0d752e154151.htm
---
# Autodesk.Revit.DB.View.CanUseTemporaryVisibilityModes Method

**中文**: 视图

Indicates if view can use temporary visibility modes

## Syntax (C#)
```csharp
public bool CanUseTemporaryVisibilityModes()
```

## Returns
True if view can use temporary visibility modes